Repository: terrameijar/nd-firefox
Catalog: nd/firefox/browser/chrome/browser/aboutPrivateBrowsing.dtd.po
Languages: nd

source: You are currently not in a private window.
nd: Okwakhathesi awukho kuwindi elifihlakeleyo.

source: Open a &Private Window
nd: Vula i&Windi Elifihlakeleyo

source: Private Browsing
nd: Ukubhrawuza Okufihlakeleyo

source: You're browsing privately
nd: Usubhrawuza okufihlakeleyo

source: Not Saved
nd: Akugcinwanga

source: History
nd: Imbali

source: Searches
nd: Dinga

source: Cookies
nd: Amakhukhi

source: Temporary Files
nd: Amafayili akhona okwesikhatshana

source: Saved
nd: Kugciniwe

source: Downloads
nd: &Amadawunlodi

source: Bookmarks
nd: Amabhukhmakhi

source: Please note that your employer or Internet service provider can still track the pages you visit.
nd: Yazi ukuba okulethela I-internet uyabona amakhasi owavakatshelayo

source: Learn More.
nd: Funda ngokunengi

source: Tracking Protection
nd: Ukuvikelwa ekuthungatheni

source: ON
nd: Sungula

source: OFF
nd: Citsha

source: Private windows now block parts of the page that may track your browsing activity.
nd: Amawindi afihlakeleyo sevale ingxenye ezithungatha okwenzayo ku-internet

source: Turn Tracking Protection Off
nd: Citsha okuvala ukuthungathwa

source: Turn Tracking Protection On
nd: Sungula okuvala ukuthungathwa

source: See how this works
nd: Bona ukuba kusebenza kanjani lokhu
