Repository: terrameijar/nd-firefox
Catalog: nd/firefox/browser/chrome/browser/aboutTabCrashed.dtd.po
Languages: nd

source: Bad news first: This tab has crashed
nd: Indaba ezimbi kuqala. I-tab siqalekile

source: Now for the good news: You can just close this tab, restore it or restore all your crashed tabs.
nd: Indaba ezimnandi. Ungavala I-tab le, uyivule katsha kumbe uvule wonke aqalekileyo katsha.

source: Submit a crash report to help prevent more bad news
nd: Sazise ngokuqaleka ukuba sivikele indaba ezimbi

source: Include the address of the page I was on
nd: Faka ikheli yekhasi ebengikulo

source: Add a comment (comments are publicly visible)
nd: Faka ingcazelo (ingcazelo ziyabonakala emphakathini)

source: Enter your email address here
nd: Faka I-email address yakho lapha

source: Email me when more information is available
nd: Lingithumele I-email sokulendaba ezintsha

source: Mozilla Crash Reporter
nd: I-crash repoter ye Mozilla

source: Crash report already submitted; thank you for helping make &brandShortName; better!
nd: I-crash report sihanjisiwe; siyabonga ukwenza I &brandShortName; ibencgono!

source: Close This Tab
nd: Vala ikhasi leli

source: Restore This Tab
nd: Vula ikhasi leli kutsha

source: Restore All Crashed Tabs
nd: Vula amakhasi wonke aqalekileyo kutsha
