Repository: terrameijar/nd-firefox
Catalog: nd/firefox/browser/chrome/browser/aboutSessionRestore.dtd.po
Languages: nd

source: Restore Session
nd: Buyisela iseshini

source: Well, this is embarrassing.
nd: Aaah, lokhu kwenza sibe lenhloni.

source: &brandShortName; is having trouble recovering your windows and tabs. This is usually caused by a recently opened web page.
nd: i &brandShortName; iba lobunzima ekutholeni ama-window lamathebhu akho. Lokhu kubangelwa yikuvulwa kwekhasi lewebhu okwenzakale khathesi.

source: You can try:
nd: Ungazama:

source: Removing one or more tabs that you think may be causing the problem
nd: Ukukhipha ithebh elilodwa kumbe ambalwa onakana ukuthi mhlawumbe yiwo adala uhlupho

source: Starting an entirely new browsing session
nd: Ukuqalisa i-seshini entsha yokubhrawuza

# restorepage.tryagainButton
source: Restore
nd: Buyisela

source: Close
nd: Vala

# restorepage.restoreHeader
source: Restore
nd: Buyisela

source: Windows and Tabs
nd: Amawindi Lamathebhu

source: Window %S
nd: Iwindi %S

source: Let's go!
nd: Asenze!

# welcomeback2.tabtitle
source: Success!
nd: Kwenzile!

# welcomeback2.pageTitle
source: Success!
nd: Kwenzile!

source: &brandShortName; is ready to go.
nd: I &brandShortName; simelele ukwenza

source: Restore all Windows and Tabs
nd: Buyisela ama-windows lama tabs

source: Restore only the ones you want
nd: Buyisela owafisayo nje

source: Your add-ons and customizations have been removed and your browser settings have been restored to their defaults. If this didn't fix your issue,
nd: Ama add-on akho lokulungisa kwakho sokukhutshiwe kwathi amasethingi e-browser yakho abiselwa esimweni kuqala. Nxa lokhu kungalungisanga inking yakho,

source: learn more about what you can do.
nd: funda ngokunengi ongakwenza

source: Migrate your other Tab Groups
nd: Tshintsha ama-tab groups akho amanye

source: We've removed Tab Groups, but saved your tabs
nd: Sikhuphe ama-tab groups, kodwa satshiya ama tabs akho

source: Learn about Tab Groups replacement add-ons.
nd: Funda ngama-tab groups lama replacement add-ons

source: &brandShortName; has bookmarked all your groups so you haven't lost anything.
nd: &brandShortName; isifake ama-bookmark kuma-group akho kusitsho ukuba awulahlekelwanga yilutho

source: Show Bookmarked Tab Groups
nd: Tshengisa ama-tab groups akuma-Bookmark

source: You can also choose to restore some or all background groups into windows now:
nd: Ungakhetha ukuba ubuyisele amanye kumbe wonke ama-background groups abe ngama-window
